#+TITLE: Zemacs configuration
#+author: Alexander Wang

** Environment Setup
   Emacs fails to properly load environment variables in some operating systems so we can install ~exec-path-from-shell~ to fix that.

  #+BEGIN_SRC emacs-lisp
    (use-package exec-path-from-shell 
        :ensure t)
    (exec-path-from-shell-initialize)
  #+END_SRC

  #+RESULTS:
  : ((MANPATH . ) (PATH . /usr/local/texlive/2022/bin/x86_64-linux:/usr/local/texlive/2022/bin/x86_64-linux:/usr/local/sbin:/usr/local/bin:/usr/sbin:/usr/bin:/sbin:/bin:/usr/games:/usr/local/games:/snap/bin:/snap/bin))

** Basic Setup
   This section contains several basic settings within emacs such as loading the language, disabling the toolbar, and setting up the autosave directory etc.

#+BEGIN_SRC emacs-lisp
  ;; Don't show the splash screen
  (setq inhibit-startup-message t)

  ;; Don't flash or ring the bell
  (setq visible-bell nil)
  (setq ring-bell-function 'ignore)
  
  ;; Disable scrollbar, toolbar, and menubar.
  (scroll-bar-mode -1)
  (tool-bar-mode -1)
  (menu-bar-mode -1)

  ;; Improves scrolling behavior when cursor moves off screen
  (setq scroll-conservatively most-positive-fixnum)

  ;; Cursor settings
  (setq-default cursor-type '(bar . 2))
  (blink-cursor-mode 0)

  ;; Set language environment to UTF-8
  (set-language-environment "UTF-8")
  (set-default-coding-systems 'utf-8)
  
  ;; Enable soft-wrap
  (global-visual-line-mode 1)

  ;; Move all the backup files to specific cache directory
  ;; This way you won't have annoying temporary files starting with ~(tilde) in each directory
  ;; Following setting will move temporary files to specific folders inside cache directory in EMACS_DIR
  ;; Credit: https://github.com/neppramod/java_emacs/blob/master/emacs-configuration.org

  (setq user-cache-directory (concat EMACS_DIR "cache"))
  (setq backup-directory-alist `(("." . ,(expand-file-name "backups" user-cache-directory)))
      url-history-file (expand-file-name "url/history" user-cache-directory)
      auto-save-list-file-prefix (expand-file-name "auto-save-list/.saves-" user-cache-directory)
      projectile-known-projects-file (expand-file-name "projectile-bookmarks.eld" user-cache-directory))

  ;; Org-mode issue with src block not expanding
  ;; This is a fix for bug in org-mode where <s TAB does not expand SRC block
  (when (version<= "9.2" (org-version))
  (require 'org-tempo))

  ;; Automatically pair brackets and braces
  (electric-pair-mode 1)

  ;; Turn on line numbers for programming modes
  (add-hook 'prog-mode-hook 'linum-mode)
  (setq linum-format " %d") 

  ;; Set font
  (set-face-attribute 'default nil :font "Ubuntu Mono" :height 160)

  ;; Set tab-width to 4
  (setq-default tab-width 4)

  ;; Highlight matching brackets and braces
  (use-package paren
    :ensure nil
    :init
    (setq show-paren-delay 0)
    :config
    (show-paren-mode +1)
  )

  ;; Turn on tab-bar-mode for and configure it
  (add-hook 'prog-mode-hook 'tab-bar-mode)
#+END_SRC

#+RESULTS:
| yas-minor-mode | tab-bar-mode | linum-mode |

** Pdf-tools and Midnite Mode
*pdf-tools* improves the pdf viewing experience drastically and *midnite-mode* allows us to set a pdf contrast that adheres to the Nord theme. In *pdf-view-mode*, the keys ~!,@,#,$,%~ can be used to set the midnite mode to each of the themes explained below.
#+BEGIN_SRC emacs-lisp
  ;; Installing pdf-tools and friends
(use-package pdf-tools
  :ensure t)

;;; Code:
(pdf-tools-install)

(require 'pdf-occur)
(require 'pdf-history)
(require 'pdf-tools)
(require 'pdf-outline)
(require 'pdf-annot)

;; midnite mode hook
(add-hook 'pdf-view-mode-hook (lambda ()
                                (pdf-view-midnight-minor-mode))) ; automatically turns on midnight-mode for pdfs

(setq pdf-view-midnight-colors '("#d8dee9" . "#3b4252"))

(defun pdf-no-filter ()
  "View pdf without colour filter."
  (interactive)
  (pdf-view-midnight-minor-mode -1)
  )

;; change midnite mode colours functions
(defun pdf-midnite-nord-original ()
  "Set pdf-view-midnight-colors to Nord colour scheme colours."
  (interactive)
  (setq pdf-view-midnight-colors '("#d8dee9" . "#3b4252")) ; Nord colour palette
  (pdf-view-midnight-minor-mode)
  )

(defun pdf-midnite-nord-amber ()
  "Set pdf-view-midnight-colors to Nord colour scheme yellow on slate gray."
  (interactive)
  (setq pdf-view-midnight-colors '("#ebcb8b" . "#3b4252")) ; Nord colour palette
  (pdf-view-midnight-minor-mode)
  )

(defun pdf-midnite-nord-green ()
  "Set pdf-view-midnight-colors to Nord colour scheme green on slate gray."
  (interactive)
  (setq pdf-view-midnight-colors '("#a3be8c" . "#3b4252")) ; Nord colour palette
  (pdf-view-midnight-minor-mode)
  )

(defun pdf-midnite-nord-blue ()
  "Set pdf-view-midnight-colors to Nord colour scheme blue on slate gray."
  (interactive)
  (setq pdf-view-midnight-colors '("#88c0d0" . "#3b4252")) ; Nord colour palette
  (pdf-view-midnight-minor-mode)
  )

(defun pdf-midnite-colour-schemes ()
  "Midnight mode colour schemes bound to keys"
  (local-set-key (kbd "!") (quote pdf-no-filter))
  (local-set-key (kbd "@") (quote pdf-midnite-nord-amber))
  (local-set-key (kbd "#") (quote pdf-midnite-nord-green))
  (local-set-key (kbd "$") (quote pdf-midnite-nord-blue))
  (local-set-key (kbd "%") (quote pdf-midnite-nord-original))
  )

(add-hook 'pdf-view-mode-hook 'pdf-midnite-colour-schemes)
#+END_SRC

#+RESULTS:
| pdf-midnite-colour-schemes | (lambda nil (pdf-view-midnight-minor-mode)) | pdf-tools-enable-minor-modes |

